{
    "column-one": "React (також відомий як react.js або reactjs)-це безкоштовна та бібліотека JavaScript з відкритим кодом, яка спрямована на те, щоб зробити інтерфейси користувачів будівель на основі компонентів більш \"безшовним\". Його підтримують META (раніше Facebook) та спільнота окремих розробників та компаній. React може бути використаний для розробки односторінкових, мобільних або серверних програм із рамками, як Next.js та Remix [A]. Оскільки React стосується лише користувальницького інтерфейсу та надання компонентів до DOM, програми React часто покладаються на бібліотеки для маршрутизації та іншої функціональності на стороні клієнта. Ключовою перевагою React є те, що він лише переоцінює ті частини сторінки, які змінилися, уникаючи непотрібного повторного відношення незмінних елементів DOM. (Weblate версія)",
    "column-three": "TypeScript (скорочений як TS)-це безкоштовна та відкрита код високої мови програмування, розроблене Microsoft, яка додає статичного введення з додатковими анотаціями типу до JavaScript. Він розроблений для розробки великих додатків та транспілів на JavaScript.\n\nTypeScript може бути використаний для розробки додатків JavaScript як для виконання на стороні клієнта, так і для сервера (як у Node.js, Deno або BUN). Для транспіляції доступно кілька варіантів. Можна використовувати компілятор TypeScript за замовчуванням, або для перетворення TypeScript у JavaScript можна викликати компілятор Babel.\n\nTypeScript підтримує файли визначення, які можуть містити інформацію про існуючі бібліотеки JavaScript, подібно до того, як файли заголовків C ++ можуть описати структуру існуючих файлів об'єктів.",
    "column-two": "Next.js-це веб-каркас на основі з відкритим кодом, створений приватною компанією Vercel, яка дозволяє розробляти веб-веб-додатки на базі веб-сайтів на стороні сервера та генерацію статичних веб-сайтів.\n\nДокументація React згадує Next.js серед \"рекомендованих інструментів\" і рекомендує розробити її під час створення веб -сайту сервера за допомогою Node.js. Незважаючи на те, що традиційні сайти React можуть відтворювати їх вміст лише в стороні клієнта, Next.js розширює цю функціональність, додаючи веб -сайт для створення веб -сайту на стороні сервера.\n\nАвторські права та торгові марки для Next.js належать до Vercel, який підтримує та очолює розробку рамок як програмного забезпечення з відкритим кодом.",
    "count_one": "{{count}} предмет",
    "count_few": "{{count}} предмети",
    "count_many": "{{count}} предметів",
    "counter": "Лічильник",
    "learn": "Натисніть логотипи Vite і React, щоб дізнатися більше",
    "less": "<0>Що таке LESS?</0><p>LESS (Leaner Style Sheets) - це препроцесор CSS, який розширює CSS динамічними функціями, такими як змінні, функції та мікшини.</p><p>Це допомагає розробникам писати багаторазові та підтримувані таблиці стилів, зменшуючи повторення в коді.</p><p>LESS компілюється в стандартний CSS і безперешкодно працює з існуючими CSS-файлами.</p><p>Він підтримує вкладені правила, роблячи стиль більш структурованим і читабельним.</p><p>LESS можна використовувати як на стороні клієнта, так і на стороні сервера, що робить його гнучким для різних проектів.</p><6>Докладніше про <2>Сторінка Вікіпедії</2>.</6>",
    "sass": "<0>Що таке SASS?</0><p>SASS (Syntactically Awesome Stylesheets) - це препроцесор, який розширює CSS такими функціями, як змінні, вкладення та змішування.</p><p>Це дозволяє розробникам писати більш чисті, більш структуровані таблиці стилів та компілювати їх у стандартний CSS.</p><p>SASS підтримує два синтаксиси: SCSS (сучасний і широко використовуваний) і старий синтаксис з відступом.</p><p>Використання SASS покращує супровідність коду, полегшуючи керування великими проектами.</p><p>Він сумісний з усіма версіями CSS і може використовуватися з різними інтерфейсними фреймворками.</p>",
    "w-article": "<0>У перекладах Weblate організовані проекти та компоненти. Кожен проект може містити кількість компонентів і тих, хто містить переклади на індивідуальні мови. Компонент відповідає одному поперечному файлу (наприклад,<1><0>GNU gettext PO (Portable Object)</0></1> або <5><0>Android string Resources</0></5>). Проекти можуть допомогти вам організувати компонент в логічні набори (наприклад, для групи всіх перекладів, які використовуються в одному додатку). Компоненти можуть міститися до категорії, а категорії можуть бути непристойними.</p><2> Це полегшує тягар репетивного та мульти-версійного перекладу. Пропагація перекладу може бути відключена за<1><0>конфігурація компонентів</0></1> за допомогою <5><0><0>Дозволяє переклад пропагацію</0></5> у випадку, якщо переклади повинні переходити.</2>"
}
