{
  "column-one": "React (znany również jako React.js lub ReactJS) to bezpłatna i open source biblioteka JavaScript, która ma na celu uczynienie budowy interfejsów użytkowników w oparciu o komponenty „bezproblemowe”. Jest utrzymywany przez Meta (wcześniej Facebook) i społeczność indywidualnych programistów i firm. React może być używany do opracowywania jednostronicowych, mobilnych lub renderowanych serwerów z frameworkami takimi jak następny.js i remiks [A]. Ponieważ React dotyczy tylko interfejsu użytkownika i renderowania komponentów do DOM, aplikacje React często polegają na bibliotekach routingu i innych funkcjach po stronie klienta. Kluczową zaletą reagowania jest to, że ponownie renderuje te części strony, które się zmieniły, unikając niepotrzebnego ponownego wydania niezmienionych elementów DOM.",
  "column-three": "TypeScript (skrócony jako TS) to bezpłatny i otwarty język programowania na wysokim poziomie opracowanym przez Microsoft, który dodaje statyczne pisanie z opcjonalnymi adnotacjami typu do JavaScript. Jest przeznaczony do opracowania dużych zastosowań i transportu do JavaScript.\n\nTypeScript może być używany do opracowywania aplikacji JavaScript zarówno do wykonania po stronie klienta, jak i po stronie serwera (jak w przypadku Node.js, Deno lub Bun). Dostępnych jest wiele opcji do transportu. Można użyć domyślnego kompilatora TypeScript lub można wywołać kompilator BABEL do konwersji TypeScript na JavaScript.\n\nTypyScript obsługuje pliki definicji, które mogą zawierać informacje o istniejących bibliotekach JavaScript, podobnie jak pliki nagłówka C ++ mogą opisać strukturę istniejących plików obiektów.",
  "column-two": "Next.js to strona internetowa oparta na kodzie typu open source, tworzona przez prywatną firmę Vercel, która pozwala opracowywać internetowe aplikacje internetowe po stronie serwera i generowanie statycznych stron internetowych.\n\nReact Documentation wspomina następny Podczas gdy tradycyjne witryny React mogą odtworzyć swoją zawartość tylko po stronie klienta, Next.js rozszerza tę funkcjonalność, dodając stronę internetową w celu wygenerowania strony internetowej po stronie serwera.\n\nPrawa autorskie i znaki handlowe dla Next.js należą do Vercel, która obsługuje i kieruje rozwojem ram jako oprogramowania typu open source.",
  "count_few": "{{count}} elementy",
  "count_many": "{{count}} elementów",
  "count_one": "{{count}} element",
  "counter": "Licznik",
  "learn": "Kliknij logo VITE i React, aby dowiedzieć się więcej",
  "less": "<0>Co to jest LESS?</0><p>LESS (Leaner Style Sheets) to preprocesor CSS, który rozszerza CSS o dynamiczne funkcje, takie jak zmienne, funkcje i miksy.</p><p>Pomaga programistom pisać arkusze stylów wielokrotnego użytku i nadające się do konserwacji, zmniejszając powtarzalność w kodzie.</p><p>LESS kompiluje się do standardowego CSS i bezproblemowo współpracuje z istniejącymi plikami CSS.</p><p>Obsługuje zagnieżdżone reguły, dzięki czemu stylizacja jest bardziej ustrukturyzowana i czytelna.</p><p>LESS można wykorzystać zarówno po stronie klienta, jak i po stronie serwera, dzięki czemu jest elastyczny dla różnych projektów.</p><6>Dowiedz się więcej na temat <2>Strona angielskiej Wikipedii</2>.</6>",
  "sass": "<0>Co to jest sass?</0><p>SASS (składniowo niesamowite arkusze stylów) to preprocesor, który rozszerza CSS o takie cechy, jak zmienne, gniazdowanie i miksiny.</p><p>Pozwala programistom pisać czystsze, bardziej ustrukturyzowane arkusze stylów i kompiluj je w standardowych CSS.</p><p>SASS obsługuje dwie składni: SCSS (nowoczesne i szeroko stosowane) oraz starszą wciętą składnię.</p><p>Korzystanie z SASS poprawia możliwość utrzymania kodu, ułatwiając zarządzanie dużymi projektami.</p><p>Jest kompatybilny ze wszystkimi wersjami CSS i może być używany z różnymi frameworkami.</p>"
}